---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.VertexPosition
source: html/6cc6f607-216c-34d9-2053-5fe7a2e0eae8.htm
---
# VertexPosition Methods

Gets the amount of storage that the vertex takes up in a buffer, measured in floats.